tutorials/icoDyMFoam/movingBlockRBF/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.3                                   |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version         2.0;
    format          ascii;
    class           volScalarField;
    object          p;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
	block
	{
		type			zeroGradient;
	}

    top
    {
        type            zeroGradient;
    }

   	bottom      
    {
        type            zeroGradient;
    }

	left
	{
		type			zeroGradient;
	}

	right
	{
		type			fixedValue;
		value			uniform 0;
	}
	
    defaultFaces
    {
        type            empty;
    }
}


// ************************************************************************* //
